// pages/order/order.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    orderList: [
      {
        name: '2张子订单',
        time: '便利店订单：14:28 | 配送：即时',
        way: '购团订单：14:28 | 配送：2016.03.18'
      },
      {
        name: '4张子订单',
        time: '便利店订单：14:28 | 配送：即时',
        way: '购团订单：14:28 | 配送：2016.03.18'
      },
      {
        name: '1张子订单',
        time: '便利店订单：14:28 | 配送：即时',
        way: '购团订单：14:28 | 配送：2016.03.18'
      },
      {
        name: '2张子订单',
        time: '便利店订单：14:28 | 配送：即时',
        way: '购团订单：14:28 | 配送：2016.03.18'
      },
      {
        name: '5张子订单',
        time: '便利店订单：14:28 | 配送：即时',
        way: '购团订单：14:28 | 配送：2016.03.18'
      },
      {
        name: '4张子订单',
        time: '便利店订单：14:28 | 配送：即时',
        way: '购团订单：14:28 | 配送：2016.03.18'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})